MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX250F256H.atdf
      <value-group caption="Parity and Data Selection bits" name="U2MODE__PDSEL">
         <value caption="9-bit data no parity" name="" value="0x3" />
         <value caption="8-bit data odd parity" name="" value="0x2" />
         <value caption="8-bit data even parity" name="" value="0x1" />
         <value caption="8-bit data no parity" name="" value="0x0" />
      </value-group>
      <value-group caption="High Baud Rate Enable bit" name="U2MODE__BRGH">
         <value caption="High-Speed mode 4x baud clock enabled" name="" value="0x1" />
         <value caption="Standard Speed mode 16x baud clock enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Polarity Inversion bit" name="U2MODE__RXINV">
         <value caption="UxRX Idle state is 0" name="" value="0x1" />
         <value caption="UxRX Idle state is 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Auto-Baud Enable bit" name="U2MODE__ABAUD">
         <value caption="Enable baud rate measurement on the next character requires reception of Sync character (0x55); cleared by hardware upon completion" name="" value="0x1" />
         <value caption="Baud rate measurement is disabled or completed" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Loopback Mode Select bit" name="U2MODE__LPBACK">
         <value caption="Loopback mode is enabled" name="" value="0x1" />
         <value caption="Loopback mode is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" name="U2MODE__WAKE">
         <value caption="Wake-up is enabled" name="" value="0x1" />
         <value caption="Wake-up is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Enable bits" name="U2MODE__UEN">
         <value caption="UxTX, UxRX and UxBCLK pins are enabled and used; UxCTS pin is controlled by corresponding bits in the PORTx register" name="" value="0x3" />
         <value caption="UxTX, UxRX, UxCTS and UxRTS pins are enabled and used" name="" value="0x2" />
         <value caption="UxTX, UxRX and UxRTS pins are enabled and used; UxCTS pin is controlled by corresponding bits in the PORTx register" name="" value="0x1" />
         <value caption="UxTX and UxRX pins are enabled and used; UxCTS and UxRTS/UxBCLK pins are controlled by corresponding bits in the PORTx register" name="" value="0x0" />
      </value-group>
      <value-group caption="Mode Selection for UxRTS Pin bit" name="U2MODE__RTSMD">
         <value caption="UxRTS pin is in Simplex mode" name="" value="0x1" />
         <value caption="UxRTS pin is in Flow Control mode" name="" value="0x0" />
      </value-group>
      <value-group caption="IrDA Encoder and Decoder Enable bit" name="U2MODE__IREN">
         <value caption="IrDA is enabled" name="" value="0x1" />
         <value caption="IrDA is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="U2MODE__SIDL">
         <value caption="Discontinue operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Enable bit" name="U2MODE__ON">
         <value caption="UARTx is enabled. UARTx pins are controlled by UARTx as defined by UEN and UTXEN control bits" name="" value="0x1" />
         <value caption="UARTx is disabled. All UARTx pins are controlled by corresponding bits in the PORTx, TRISx and LATx registers; UARTx power consumption is minimal" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop Selection bit" name="U3MODE__STSEL">
         <value caption="2 Stop bits" name="" value="0x1" />
         <value caption="1 Stop bit" name="" value="0x0" />
      </value-group>
      <value-group caption="Parity and Data Selection bits" name="U3MODE__PDSEL">
         <value caption="9-bit data no parity" name="" value="0x3" />
         <value caption="8-bit data odd parity" name="" value="0x2" />
         <value caption="8-bit data even parity" name="" value="0x1" />
         <value caption="8-bit data no parity" name="" value="0x0" />
      </value-group>
      <value-group caption="High Baud Rate Enable bit" name="U3MODE__BRGH">
         <value caption="High-Speed mode 4x baud clock enabled" name="" value="0x1" />
         <value caption="Standard Speed mode 16x baud clock enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Polarity Inversion bit" name="U3MODE__RXINV">
         <value caption="UxRX Idle state is 0" name="" value="0x1" />
         <value caption="UxRX Idle state is 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Auto-Baud Enable bit" name="U3MODE__ABAUD">
         <value caption="Enable baud rate measurement on the next character requires reception of Sync character (0x55); cleared by hardware upon completion" name="" value="0x1" />
         <value caption="Baud rate measurement is disabled or completed" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Loopback Mode Select bit" name="U3MODE__LPBACK">
         <value caption="Loopback mode is enabled" name="" value="0x1" />
         <value caption="Loopback mode is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" name="U3MODE__WAKE">
         <value caption="Wake-up is enabled" name="" value="0x1" />
         <value caption="Wake-up is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Enable bits" name="U3MODE__UEN">
         <value caption="UxTX, UxRX and UxBCLK pins are enabled and used; UxCTS pin is controlled by corresponding bits in the PORTx register" name="" value="0x3" />
         <value caption="UxTX, UxRX, UxCTS and UxRTS pins are enabled and used" name="" value="0x2" />
         <value caption="UxTX, UxRX and UxRTS pins are enabled and used; UxCTS pin is controlled by corresponding bits in the PORTx register" name="" value="0x1" />
         <value caption="UxTX and UxRX pins are enabled and used; UxCTS and UxRTS/UxBCLK pins are controlled by corresponding bits in the PORTx register" name="" value="0x0" />
      </value-group>
      <value-group caption="Mode Selection for UxRTS Pin bit" name="U3MODE__RTSMD">
         <value caption="UxRTS pin is in Simplex mode" name="" value="0x1" />
         <value caption="UxRTS pin is in Flow Control mode" name="" value="0x0" />
      </value-group>
      <value-group caption="IrDA Encoder and Decoder Enable bit" name="U3MODE__IREN">
         <value caption="IrDA is enabled" name="" value="0x1" />
         <value caption="IrDA is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="U3MODE__SIDL">
         <value caption="Discontinue operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Enable bit" name="U3MODE__ON">
         <value caption="UARTx is enabled. UARTx pins are controlled by UARTx as defined by UEN and UTXEN control bits" name="" value="0x1" />
         <value caption="UARTx is disabled. All UARTx pins are controlled by corresponding bits in the PORTx, TRISx and LATx registers; UARTx power consumption is minimal" name="" value="0x0" />
      </value-group>
